; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-19)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 )
(:init
(arm-empty)
(on-table b1)
(on-table b2)
(on b3 b5)
(on b4 b18)
(on b5 b1)
(on b6 b12)
(on b7 b16)
(on b8 b17)
(on-table b9)
(on-table b10)
(on b11 b2)
(on b12 b9)
(on b13 b14)
(on b14 b7)
(on b15 b6)
(on b16 b10)
(on-table b17)
(on b18 b8)
(on b19 b11)
(clear b3)
(clear b4)
(clear b13)
(clear b15)
(clear b19)
)
(:goal
(and
(on b1 b7)
(on b2 b15)
(on b3 b12)
(on b4 b18)
(on b5 b1)
(on b6 b8)
(on b7 b2)
(on b9 b10)
(on b10 b17)
(on b11 b9)
(on b12 b11)
(on b13 b16)
(on b16 b19)
(on b17 b6)
(on b19 b3))
)
)

; plan
1. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 2 of 15
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 15
3. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 1 of 15
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 15
5. (unstack b19 b11)
   deleted: (on b19 b11) (clear b19) (arm-empty)
   added: (holding b19) (clear b11)
   goals met: 1 of 15
6. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 15
7. (unstack b11 b2)
   deleted: (on b11 b2) (clear b11) (arm-empty)
   added: (holding b11) (clear b2)
   goals met: 1 of 15
8. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 15
9. (unstack b15 b6)
   deleted: (on b15 b6) (clear b15) (arm-empty)
   added: (holding b15) (clear b6)
   goals met: 1 of 15
10. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 15
11. (unstack b6 b12)
   deleted: (on b6 b12) (clear b6) (arm-empty)
   added: (holding b6) (clear b12)
   goals met: 1 of 15
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 15
13. (unstack b12 b9)
   deleted: (on b12 b9) (clear b12) (arm-empty)
   added: (holding b12) (clear b9)
   goals met: 1 of 15
14. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 15
15. (unstack b13 b14)
   deleted: (on b13 b14) (clear b13) (arm-empty)
   added: (holding b13) (clear b14)
   goals met: 1 of 15
16. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 15
17. (unstack b14 b7)
   deleted: (on b14 b7) (clear b14) (arm-empty)
   added: (holding b14) (clear b7)
   goals met: 1 of 15
18. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 15
19. (unstack b7 b16)
   deleted: (on b7 b16) (clear b7) (arm-empty)
   added: (holding b7) (clear b16)
   goals met: 1 of 15
20. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 15
21. (unstack b16 b10)
   deleted: (on b16 b10) (clear b16) (arm-empty)
   added: (holding b16) (clear b10)
   goals met: 1 of 15
22. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 15
23. (unstack b4 b18)
   deleted: (on b4 b18) (clear b4) (arm-empty)
   added: (holding b4) (clear b18)
   goals met: 0 of 15
24. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 15
25. (unstack b18 b8)
   deleted: (on b18 b8) (clear b18) (arm-empty)
   added: (holding b18) (clear b8)
   goals met: 0 of 15
26. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 15
27. (unstack b8 b17)
   deleted: (on b8 b17) (clear b8) (arm-empty)
   added: (holding b8) (clear b17)
   goals met: 0 of 15
28. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 15
29. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 0 of 15
30. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 1 of 15
31. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 1 of 15
32. (stack b17 b6)
   deleted: (clear b6) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b6)
   goals met: 2 of 15
33. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 2 of 15
34. (stack b10 b17)
   deleted: (clear b17) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b17)
   goals met: 3 of 15
35. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 3 of 15
36. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 4 of 15
37. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 4 of 15
38. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 5 of 15
39. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 5 of 15
40. (stack b12 b11)
   deleted: (clear b11) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b11)
   goals met: 6 of 15
41. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 15
42. (stack b3 b12)
   deleted: (clear b12) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b12)
   goals met: 7 of 15
43. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 7 of 15
44. (stack b19 b3)
   deleted: (clear b3) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b3)
   goals met: 8 of 15
45. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 8 of 15
46. (stack b16 b19)
   deleted: (clear b19) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b19)
   goals met: 9 of 15
47. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 9 of 15
48. (stack b13 b16)
   deleted: (clear b16) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b16)
   goals met: 10 of 15
49. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 10 of 15
50. (stack b4 b18)
   deleted: (clear b18) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b18)
   goals met: 11 of 15
51. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 11 of 15
52. (stack b2 b15)
   deleted: (clear b15) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b15)
   goals met: 12 of 15
53. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 12 of 15
54. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 13 of 15
55. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 13 of 15
56. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 14 of 15
57. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 14 of 15
58. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 15 of 15
